start_command_message = (
    "👋 Добро пожаловать!\n\n"
    "Этот бот поможет вам быстро и удобно оставить заявку. "
    "Мы соберём всю необходимую информацию — от имени и услуги до деталей, файлов и способа связи. "
    "После подтверждения заявка будет передана нашему менеджеру.\n\n"
    "📌 Нажмите кнопку ниже, чтобы начать."
)

name_application_message = "📝 Пожалуйста, укажите ваше имя и фамилию.\n\nКак к вам обращаться?"
service_application_message = "📂 Выберите услугу, которая вас интересует:"
details_application_message = "📄 Опишите подробнее, что именно вам требуется."
file_application_message = "📎 Вы можете прикрепить фото, видео, документы (Просто отправьте как угодно сюда)."
contact_application_message = "📞 Укажите, как с вами можно связаться:"
confirm_application_message = "✅ Проверьте данные заявки.\n\nВсё верно?"
no_username_message = "⚠️ У вас не указан username. Пожалуйста, выберите другой способ связи."
is_not_file_message = "❌ Это не фото и не документ. Пожалуйста, отправьте файл заново."
phone_number_message = "📱 Введите ваш номер телефона."
invalid_phone_number = "⚠️ Похоже, что номер введён некорректно. Попробуйте снова."
final_application_message = (
    "🎉 Ваша заявка успешно отправлена менеджеру!\n\n"
    "Мы свяжемся с вами в ближайшее время. Спасибо, что обратились к нам 🙌"
    "Примерно так будет работать бот, который вы можете заказать"
)

start_application_btn = "📝 Оставить заявку"
skip_btn = "➡️ Пропустить"
step_back_btn = "⬅️ Назад"
home_btn = "🏠 Вернуться к началу"
username_btn = "💬 Написать в Telegram"
phone_number_btn = "📞 Позвонить"
share_phone_number_btn = "📲 Поделиться контактом"
confirm_application_btn = "✅ Подтвердить"
next_btn = "➡️ Далее"

buttons = [
    "📐 Репетитор по математике",
    "🇬🇧 Курсы английского",
    "💰 Финансовая консультация",
    "👨‍🏫 Наставничество по бизнесу",
    "✍️ Копирайтинг",
    "🚀 Менторство по стартапам",
    "🎯 Подготовка к собеседованию",
    "💻 Переустановка Windows",
    "🛠 Удалённая настройка ПК",
    "☁️ Резервное копирование данных",
    "🤖 Разработка чат-ботов"
]
